// Models of the Suppression section.

package suppression

// SuppressionSetRequest
type SuppressionSetRequest struct {
	// Email-адреса, яку потрібно додати до списку недоступних.
	Email string `json:"email"`

	// Причина, з якої надсилання на цей email блокується. Одна з таких:
	//
	// - __unsubscribed__ - зазначену адресу відписано;
	// - __temporary_unavailable__ - адреса тимчасово недоступна. Це означає, що протягом наступних трьох діб надсилання на цю адресу повертатиме помилку. Email може бути тимчасово недоступним з різних причин, наприклад:
	//
	// - попереднє надсилання було відхилено сервером отримувача як спам;
	// - поштова скринька отримувача переповнена або не використовується;
	// - домен не приймає пошту через неправильне налаштування на боці отримувача або з інших причин;
	// - сервер відправника було відхилено через блеклистинг;
	//
	// - __permanent_unavailable__ - адреса перманентно недоступна через багаторазові недоставки;
	// - __complained__ - в одному з попередніх листів адресат натиснув “Це спам”.
	Cause string `json:"cause"`

	// Коли було встановлено недоступність, у часовому поясі UTC у форматі "РРРР-ММ-ДД гг:хх:сс".
	Created *string `json:"created,omitempty"`
}

// SuppressionGetRequest
type SuppressionGetRequest struct {
	// Email-адреса, для якої потрібно отримати дані про недоступність.
	Email string `json:"email"`

	// Якщо у користувача увімкнено проєкти, all_projects=true дозволить шукати за даними всіх проєктів.
	// За замовчуванням: `False`.
	AllProjects *bool `json:"all_projects,omitempty"`
}

// SuppressionGetResponse
type SuppressionGetResponse struct {
	// Рядок "success".
	// Допустимі значення: `success`.
	Status string `json:"status,omitempty"`

	// Email-адреса, для якої було запитано дані про недоступність.
	Email string `json:"email,omitempty"`

	// Масив об'єктів з інформацією про недоступність.
	Suppressions []SuppressionGetObject `json:"suppressions,omitempty"`
}

// SuppressionGetObject — Об'єкт з даними про блокування email.
type SuppressionGetObject struct {
	// Унікальний ідентифікатор проєкту, ASCII-рядок до 36 символів завдовжки.
	ProjectID string `json:"project_id,omitempty"`

	// Причина, з якої надсилання на цей email блокується. Одна з таких:
	//
	// - __unsubscribed__ - зазначену адресу відписано;
	// - __temporary_unavailable__ - адреса тимчасово недоступна. Це означає, що протягом наступних трьох діб надсилання на цю адресу повертатиме помилку. Email може бути тимчасово недоступним з різних причин, наприклад:
	//
	// - попереднє надсилання було відхилено сервером отримувача як спам;
	// - поштова скринька отримувача переповнена або не використовується;
	// - домен не приймає пошту через неправильне налаштування на боці отримувача або з інших причин;
	// - сервер відправника було відхилено через блеклистинг;
	//
	// - __permanent_unavailable__ - адреса перманентно недоступна через багаторазові недоставки;
	// - __complained__ - в одному з попередніх листів адресат натиснув “Це спам”.
	// - __blocked__ - надсилання на цю адресу заборонено адміністрацією AllyMailer.
	// У майбутньому можуть з'явитися й інші причини.
	Cause string `json:"cause,omitempty"`

	// Джерело потрапляння до списку недоступних. Одне з таких:
	//
	// - __user__ - дії користувача за допомогою методу [suppression/set](https://docs.allymailer.com.ua/ua/web-api-ref#suppression-set);
	// - __system__ - надсилання на цю адресу заборонено системою, наприклад через багаторазові недоставки;
	// - __subscriber__ - у зв'язку з діями отримувача. В одному з попередніх листів адресат натиснув “Це спам” або відписався.
	Source string `json:"source,omitempty"`

	// Чи можна видалити запис за допомогою виклику suppression/delete.
	IsDeletable bool `json:"is_deletable,omitempty"`

	// Коли було встановлено недоступність, у часовому поясі UTC у форматі "РРРР-ММ-ДД гг:хх:сс".
	Created string `json:"created,omitempty"`
}

// SuppressionListRequest
type SuppressionListRequest struct {
	// Причина, з якої надсилання на цей email блокується. Одна з таких:
	//
	// - __unsubscribed__ - зазначену адресу відписано;
	// - __temporary_unavailable__ - адреса тимчасово недоступна. Це означає, що протягом наступних трьох діб надсилання на цю адресу повертатиме помилку. Email може бути тимчасово недоступним з різних причин, наприклад:
	//
	// - попереднє надсилання було відхилено сервером отримувача як спам;
	// - поштова скринька отримувача переповнена або не використовується;
	// - домен не приймає пошту через неправильне налаштування на боці отримувача або з інших причин;
	// - сервер відправника було відхилено через блеклистинг;
	//
	// - __permanent_unavailable__ - адреса перманентно недоступна через багаторазові недоставки;
	// - __complained__ - в одному з попередніх листів адресат натиснув “Це спам”.
	// - __blocked__ - надсилання на цю адресу заборонено адміністрацією AllyMailer.
	// У майбутньому можуть з'явитися й інші причини.
	Cause *string `json:"cause,omitempty"`

	// Джерело потрапляння до списку недоступних. Одне з таких:
	//
	// - __user__ - дії користувача за допомогою методу [suppression/set](https://docs.allymailer.com.ua/ua/web-api-ref#suppression-set);
	// - __system__ - надсилання на цю адресу заборонено системою, наприклад через багаторазові недоставки;
	// - __subscriber__ - у зв'язку з діями отримувача. В одному з попередніх листів адресат натиснув “Це спам” або відписався.
	Source *string `json:"source,omitempty"`

	// Дата у форматі РРРР-ММ-ДД гг:хх:сс, щоб отримати список блокування з "start_time" по сьогоднішній
	// день. Ігнорується, якщо параметр “cursor” не порожній.
	StartTime *string `json:"start_time,omitempty"`

	// Параметр указує, з якої позиції починати вибірку. Має бути порожнім або відсутнім для отримання
	// першої порції даних; для отримання другої та наступних порцій його необхідно задавати, підставляючи
	// значення поля "cursor" з попередньої порції.
	Cursor *string `json:"cursor,omitempty"`

	// Максимум записів, що видаються за один раз, за замовчуванням 50.
	Limit *int `json:"limit,omitempty"`
}

// SuppressionListResponse
type SuppressionListResponse struct {
	// Рядок "success".
	// Допустимі значення: `success`.
	Status string `json:"status,omitempty"`

	// Масив об'єктів з інформацією про недоступність.
	Suppressions []SuppressionListObject `json:"suppressions,omitempty"`

	// Параметр указує, з якої позиції починати вибірку. Має бути порожнім або відсутнім для отримання
	// першої порції даних; для отримання другої та наступних порцій його необхідно задавати, підставляючи
	// значення поля "cursor" з попередньої порції.
	Cursor string `json:"cursor,omitempty"`
}

// SuppressionListObject — Об'єкт з даними про блокування email.
type SuppressionListObject struct {
	// Email-адреса, яка знаходиться в списку недоступних.
	Email string `json:"email,omitempty"`

	// Причина, з якої надсилання на цей email блокується. Одна з таких:
	//
	// - __unsubscribed__ - зазначену адресу відписано;
	// - __temporary_unavailable__ - адреса тимчасово недоступна. Це означає, що протягом наступних трьох діб надсилання на цю адресу повертатиме помилку. Email може бути тимчасово недоступним з різних причин, наприклад:
	//
	// - попереднє надсилання було відхилено сервером отримувача як спам;
	// - поштова скринька отримувача переповнена або не використовується;
	// - домен не приймає пошту через неправильне налаштування на боці отримувача або з інших причин;
	// - сервер відправника було відхилено через блеклистинг;
	//
	// - __permanent_unavailable__ - адреса перманентно недоступна через багаторазові недоставки;
	// - __complained__ - в одному з попередніх листів адресат натиснув “Це спам”.
	// - __blocked__ - надсилання на цю адресу заборонено адміністрацією AllyMailer.
	// У майбутньому можуть з'явитися й інші причини.
	Cause string `json:"cause,omitempty"`

	// Джерело потрапляння до списку недоступних. Одне з таких:
	//
	// - __user__ - дії користувача за допомогою методу [suppression/set](https://docs.allymailer.com.ua/ua/web-api-ref#suppression-set);
	// - __system__ - надсилання на цю адресу заборонено системою, наприклад через багаторазові недоставки;
	// - __subscriber__ - у зв'язку з діями отримувача. В одному з попередніх листів адресат натиснув “Це спам” або відписався.
	Source string `json:"source,omitempty"`

	// Чи можна видалити запис за допомогою виклику suppression/delete.
	IsDeletable bool `json:"is_deletable,omitempty"`

	// Коли було встановлено недоступність, у часовому поясі UTC у форматі "РРРР-ММ-ДД гг:хх:сс".
	Created string `json:"created,omitempty"`
}

// SuppressionDeleteRequest
type SuppressionDeleteRequest struct {
	// Email-адреса, яку потрібно видалити зі списку недоступних.
	Email string `json:"email"`
}
